---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizeSettings.GetConduitSizeSettingsIterator
source: html/8d9283aa-e31a-b7bc-66e3-08b9ed143d54.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeSettings.GetConduitSizeSettingsIterator Method

Returns a ConduitSizeSettingIterator to the conduit size settings.

## Syntax (C#)
```csharp
public ConduitSizeSettingIterator GetConduitSizeSettingsIterator()
```